---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions.PlanView
enum: Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions
source: html/3daf2ae9-b313-b278-f462-e91412298a52.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailFor3DShapesOptions.PlanView

The bending detail will represent the bar as in a plan view where the view plane is parallel with bar plane.